---
type: PlanCircuit
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# PlanCircuit

`Autodesk.Revit.DB.PlanCircuit` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetPointInside | 2015 | `public UV GetPointInside ()` |
| Property | Area | — | `public double Area { get ; }` |
| Property | IsRoomLocated | — | `public bool IsRoomLocated { get ; }` |
| Property | SideNum | — | `public int SideNum { get ; }` |